##====================================================================
##  有向グラフの隣接行列
##--------------------------------------------------------------------
##
##====================================================================

$0 !~ /^#/ {
    node[$1] = 1;
    for ( k = 2; k <= NF; k++ ) {
        Rel[$1][$k] = 1;
    }
}

END {
    ##----  ラベルの横軸の出力
    printf "  ";
    for ( x in node ) { printf " " x; }
    print "";
    ##----  ラベルの縦軸と隣接行列の成分の出力
    for ( x in node ) {
        printf " " x;
        for ( y in node ) {
            if ( Rel[x][y] == 1 ) { printf " " 1; } else { printf " " 0; } 
        }
	print ""
    }
}
